saurabh-nishad/STM8L-Discovery/ADC_DMA/main.c
/**
  ******************************************************************************
  * @file    ADC/ADC_DMA/main.c
  * @author  MCD Application Team
  * @version V1.5.2
  * @date    30-September-2014
  * @brief   Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2014 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */ 

/* Includes ------------------------------------------------------------------*/
#include "stm8l15x.h"

#include "stm8l_discovery_lcd.h"
#include <math.h>
#include "delay.h"
/** @addtogroup STM8L15x_StdPeriph_Examples
  * @{
  */

/** @addtogroup ADC_DMA
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define ADC1_DR_ADDRESS        ((uint16_t)0x5344)
#define BUFFER_SIZE            ((uint8_t) 0x02)
#define BUFFER_ADDRESS         ((uint16_t)(&Buffer))
#define ASCII_NUM_0            ((uint8_t)   48)

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
uint16_t Buffer[BUFFER_SIZE]  = {0, 0};
uint32_t PotVoltage = 0;
uint32_t BNCVoltage = 0;
uint8_t LCDString[16];
FunctionalState DisplayStatus = DISABLE;

u16 display_array[6];
extern u8 t_bar[2];
/* Private function prototypes -----------------------------------------------*/
static void CLK_Config(void);
static void ADC_Config(void);
static void DMA_Config(void);
void showVoltage(int voltage);
void showBar(int voltage);

#define LED_GR_PORT              		GPIOE
#define LED_GR_PIN               		GPIO_Pin_7

/* Private functions ---------------------------------------------------------*/

/**
  * @brief  Main program.
  * @param  None
  * @retval None
  */
void main(void)
{

   /* CLK configuration -------------------------------------------*/
  CLK_Config(); 

  LCD_GLASS_Init();
  GPIO_Init(LED_GR_PORT, LED_GR_PIN, GPIO_Mode_Out_PP_High_Fast);
   /* ADC configuration -------------------------------------------*/
  ADC_Config();

   /* DMA configuration -------------------------------------------*/
  DMA_Config();
    
  /* Enable ADC1 DMA requests*/
  ADC_DMACmd(ADC1, ENABLE);

  /* Start ADC1 Conversion using TIM1 TRGO*/
  ADC_ExternalTrigConfig(ADC1, ADC_ExtEventSelection_Trigger2, ADC_ExtTRGSensitivity_Rising);

  /* Master Mode selection: Update event */
  TIM1_SelectOutputTrigger(TIM1_TRGOSource_Update);

  /* Enable TIM1 */
  TIM1_Cmd(ENABLE);

  /* Enable Interrupts */
  enableInterrupts();

  /* Infinite loop*/
  display_array[0] = '1';
  display_array[1] = '1';
  display_array[1] |= DOUBLE_DOT;
  display_array[2] = '4';
  display_array[3] = '7';
  display_array[4] = '';

  BAR0_ON;
  BAR1_ON;
  BAR2_ON;
  LCD_GLASS_DisplayStrDeci(display_array);
  while (1)
  {
    GPIO_WriteBit(LED_GR_PORT, LED_GR_PIN, SET);
  }
}

/**
  * @brief  Configure peripherals and system clock
  * @param  None
  * @retval None
  */
static void CLK_Config(void)
{
  /*High speed external clock prescaler: 1*/
  CLK_SYSCLKDivConfig(CLK_SYSCLKDiv_1);

  /* Enable ADC1 clock */
  CLK_PeripheralClockConfig(CLK_Peripheral_ADC1, ENABLE);

  /* Enable DMA1 clock */
  CLK_PeripheralClockConfig(CLK_Peripheral_DMA1, ENABLE);

  /* Enable TIM1 clock */
  CLK_PeripheralClockConfig(CLK_Peripheral_TIM1, ENABLE);
}

/**
  * @brief  Configure ADC peripheral 
  * @param  None
  * @retval None
  */
static void ADC_Config(void)
{
  /* Initialize and configure ADC1 */
  ADC_Init(ADC1, ADC_ConversionMode_Single, ADC_Resolution_12Bit, ADC_Prescaler_2);
  ADC_SamplingTimeConfig(ADC1, ADC_Group_SlowChannels, ADC_SamplingTime_384Cycles);
  ADC_SamplingTimeConfig(ADC1, ADC_Group_FastChannels, ADC_SamplingTime_384Cycles);

  /* Enable ADC1 */
  ADC_Cmd(ADC1, ENABLE);

  /* Enable ADC1 Channels 3 */
  ADC_ChannelCmd(ADC1, ADC_Channel_3, ENABLE); /* connected to Potentiometer RV */
  /* Enable ADC1 Channels 24 */
  ADC_ChannelCmd(ADC1, ADC_Channel_24, ENABLE); /* connected to BNC */
}

/**
  * @brief  Configure DMA peripheral 
  * @param  None
  * @retval None
  */
static void DMA_Config(void)
{
  /* Connect ADC to DMA channel 0 */
  SYSCFG_REMAPDMAChannelConfig(REMAP_DMA1Channel_ADC1ToChannel0);

  DMA_Init(DMA1_Channel0, BUFFER_ADDRESS,
           ADC1_DR_ADDRESS,
           BUFFER_SIZE,
           DMA_DIR_PeripheralToMemory,
           DMA_Mode_Circular,
           DMA_MemoryIncMode_Inc,
           DMA_Priority_High,
           DMA_MemoryDataSize_HalfWord);

  /* DMA Channel0 enable */
  DMA_Cmd(DMA1_Channel0, ENABLE);

  /* Enable DMA1 channel0 Transfer complete interrupt */
  DMA_ITConfig(DMA1_Channel0, DMA_ITx_TC, ENABLE);

  /* DMA enable */
  DMA_GlobalCmd(ENABLE);
}


void showVoltage(int voltage)
{
  uint8_t voltage1000 = 0;
  uint8_t voltage100 = 0;
  uint8_t voltage10 = 0;

  /* Thousands voltage value*/
  voltage1000 = (uint8_t)(voltage / 1000);
  /* Hundreds voltage value */
  voltage100 = (uint8_t)((voltage % 1000) / 100);
  /* Tens voltage value */
  voltage10 = (uint8_t)((voltage % 100 ) / 10);
  
    /* Fill the LCDString fields with the current Voltage */
  display_array[0] = voltage1000 + 48;
  display_array[0] |= DOT;
  display_array[1] = voltage100 + 48;
  display_array[2] = voltage10 + 48;
  display_array[3] = 'V';
  showBar(voltage);
  LCD_GLASS_DisplayStrDeci(display_array);
}

void showBar(int voltage)
{
  if(voltage > 3000)
  {
    BAR0_ON; BAR1_ON; BAR2_ON; BAR3_ON;
  }
  if(voltage <= 3000 && voltage > 2500 )
  {
    BAR0_ON; BAR1_ON; BAR2_ON; BAR3_OFF;
  }
  if(voltage <= 2500 && voltage > 2000)
  {
    BAR0_ON; BAR1_ON; BAR2_OFF; BAR3_OFF;
  }
  if(voltage <= 2000 && voltage > 1500)
  {
    BAR0_ON; BAR1_OFF; BAR2_OFF; BAR3_OFF;
  }
  if(voltage <= 1500)
  {
    BAR0_OFF; BAR1_OFF; BAR2_OFF; BAR3_OFF;
  }


#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *   where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {

  }
}
#endif
/**
  * @}
  */

/**
  * @}
  */
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
